tests/fixtures/vcr_cassettes/payments/validate_and_create_with_sca.json

{
  "http_interactions": [
    {
      "recorded_at": "2017-05-15T10:49:50",
      "request": {
        "body": {
          "encoding": "utf-8",
          "string": "login_id=development%40currencycloud.com&api_key=deadbeefdeadbeefdeadbeefdeadbeefdeadbeefdeadbeefdeadbeefdeadbeef"
        },
        "headers": {
          "Accept": "*/*",
          "Accept-Encoding": "gzip, deflate",
          "Connection": "keep-alive",
          "Content-Length": "116",
          "Content-Type": "application/x-www-form-urlencoded",
          "User-Agent": "CurrencyCloudSDK/2.0 Python/9.1.0"
        },
        "method": "POST",
        "uri": "https://devapi.currencycloud.com/v2/authenticate/api"
      },
      "response": {
        "body": {
          "base64_string": "H4sIAB4ZmmgAA6tWSiwtyYgvyc9OzVOyUko1T0o0MzBISUlKM0lLNDQytTROtTA3T001S7Y0NTQ0VKrlAgADSmQeMgAAAA==",
          "encoding": "utf-8",
          "string": ""
        },
        "headers": {
          "CF-RAY": "35f58861a97d357e-LHR",
          "Connection": "keep-alive",
          "Content-Encoding": "gzip",
          "Content-Type": "application/json;charset=utf-8",
          "Date": "Mon, 15 May 2017 10:49:50 GMT",
          "Server": "cloudflare-nginx",
          "Set-Cookie": "__cfduid=ddd9c5a9980caca36affe153464ad6ce91494845389; expires=Tue, 15-May-18 10:49:49 GMT; path=/; domain=.thecurrencycloud.com; HttpOnly",
          "Transfer-Encoding": "chunked",
          "Vary": "Origin",
          "X-Content-Type-Options": "nosniff",
          "X-Request-Id": "3316299952793766431"
        },
        "status": {
          "code": 200,
          "message": "OK"
        },
        "url": "https://devapi.currencycloud.com/v2/authenticate/api"
      }
    },
    {
      "request": {
        "body": {
          "encoding": "utf-8",
          "string": "currency=GBP&beneficiary_id=a0bd2d78-3621-4c29-932f-a39d6b34d5e7&amount=1000&reason=Testing+SCA+payments&reference=Testing+SCA+payments&payment_type=regular"
        },
        "headers": {
          "User-Agent": ["CurrencyCloudSDK/2.0 Python/9.1.0"],
          "Accept-Encoding": ["gzip, deflate"],
          "Accept": ["*/*"],
          "Connection": ["keep-alive"],
          "X-Auth-Token": ["e7ba600ddbf4fa12593e877ee6c95111"],
          "x-sca-to-authenticated-user": "true",
          "Cookie": "__cfduid=d62cecb57f2fbb5c324234a525421ae381494843198",
          "Content-Length": ["148"],
          "Content-Type": ["application/x-www-form-urlencoded"]
        },
        "method": "POST",
        "uri": "https://devapi.currencycloud.com/v2/payments/validate"
      },
      "response": {
        "body": {
          "encoding": "utf-8",
          "string": "{\"validation_result\":\"success\"}"
        },
        "headers": {
          "Date": ["Thu, 25 Jan 2024 14:14:27 GMT"],
          "Content-Type": ["application/json;charset=utf-8"],
          "Content-Length": ["31"],
          "Connection": ["keep-alive"],
          "Access-Control-Allow-Headers": [
            "authorization,Access-Control-Allow-Origin,Content-Type,SOAPAction,apikey,testKey,X-Auth-Token,Origin,Authority,User-Agent,x-google-recaptcha-v3-token,Authorization,Authorization"
          ],
          "Access-Control-Allow-Methods": ["POST"],
          "Access-Control-Allow-Origin": ["*"],
          "Access-Control-Expose-Headers": [""],
          "Cache-Control": [
            "no-cache, no-store, must-revalidate, max-age=0, s-maxage=0, private"
          ],
          "Expires": ["0"],
          "Pragma": ["no-cache"],
          "Vary": ["Origin"],
          "X-Content-Type-Options": ["nosniff"],
          "X-Envoy-Upstream-Service-Time": ["1086"],
          "X-Request-Id": ["7c34e56c-b845-4b83-9db1-46eaf7510cd0"],
          "x-sca-id": ["e99c5fb0-88b2-47b6-b9ea-77279fdb3fc2"],
          "x-sca-required": "true",
          "x-sca-type": "SMS",
          "CF-Cache-Status": ["DYNAMIC"],
          "Strict-Transport-Security": ["max-age=31536000; includeSubDomains"],
          "Server": ["cloudflare"],
          "CF-RAY": ["84b11f5f0f5d3e9a-CPT"]
        },
        "status": { "code": 200, "message": "OK" },
        "url": "https://devapi.currencycloud.com/v2/payments/validate"
      },
      "recorded_at": "2024-01-25T14:14:27"
    },
    {
      "recorded_at": "2017-05-15T10:49:51",
      "request": {
        "body": {
          "encoding": "utf-8",
          "string": "reason=Testing+SCA+payments&currency=GBP&amount=1000&beneficiary_id=a0bd2d78-3621-4c29-932f-a39d6b34d5e7&reference=Testing+SCA+payments&payment_type=regular"
        },
        "headers": {
          "Accept": "*/*",
          "Accept-Encoding": "gzip, deflate",
          "Connection": "keep-alive",
          "Content-Length": "148",
          "Content-Type": "application/x-www-form-urlencoded",
          "Cookie": "__cfduid=ddd9c5a9980caca36affe153464ad6ce91494845389",
          "User-Agent": "CurrencyCloudSDK/2.0 Python/9.1.0",
          "X-Auth-Token": "e7ba600ddbf4fa12593e877ee6c95111",
          "x-sca-id": ["e99c5fb0-88b2-47b6-b9ea-77279fdb3fc2"],
          "x-sca-token": ["123456"]
        },
        "method": "POST",
        "uri": "https://devapi.currencycloud.com/v2/payments/create"
      },
      "response": {
        "body": {
          "base64_string": "H4sIACgammgAA51Sy27cMAy89ysCXxsVki3Z0t6aBMm1QHMXKIneGnAkR48Ai6L/XsmbbPdSoOh1Zjgkh/zZLa47dJIaIyewZGJiIBxAEtkrRQSoyVglJHe0u+3gJRSfq55RSr/QBhn0OC92gXjSuxVQ43o3STKMPSPc9oqooZ8JDMqNZuBO4FTrbIkRvT3Viqe7bxWIOGNDsCLPmPLijzff77/ebHB6QZ/TLoEU/N/5lCGXVPkqdCedg07oXWtWgRyitsFnsPk8KBvFKHouCDOjIHzkSGCegQg5sIGp3gg+19p3f51PG+7Wx7JCvCIc5Eb0lE2EVjdRuRzBp7pPRKehBdbCK/lHiEuCvASvU8Yt6YivZamiqmhhrpCyLltz/L9hU+2Q9XWUbKKCCfJ0//jw8Egpa2kE/4YxtSmaty/retvNsKwlor5kfN6wzrH3twocn6UlXHFDuISRSGkYma2Vg1WKywEuFQ5zdUs6hRL3IcDa/XHeL/ERyp/Inhk9cHUQ7DOlh/2vzin8g/DjDMcYyna1UPHLa8E94fotF+LXp9+xoNtT8wIAAA==",
          "encoding": "utf-8",
          "string": ""
        },
        "headers": {
          "CF-RAY": "35f5886afd67357e-LHR",
          "Connection": "keep-alive",
          "Content-Encoding": "gzip",
          "Content-Type": "application/json;charset=utf-8",
          "Date": "Mon, 15 May 2017 10:49:51 GMT",
          "Server": "cloudflare-nginx",
          "Transfer-Encoding": "chunked",
          "Vary": "Origin",
          "X-Content-Type-Options": "nosniff",
          "X-Request-Id": "3316299965366145574"
        },
        "status": {
          "code": 200,
          "message": "OK"
        },
        "url": "https://devapi.currencycloud.com/v2/payments/create"
      }
    }
  ],
  "recorded_with": "betamax/0.8.0"
}
